In [1]:
import pandas as pd

#### score.xlsx 파일 읽기

In [2]:
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

### DataFrame 확인

#### 기초 통계량 확인

In [3]:
df.describe()

              나이          점수
count   6.000000    6.000000
mean   25.333333   85.333333
std     5.163978   15.055453
min    20.000000   60.000000
25%    21.500000   79.000000
50%    24.000000   89.000000
75%    28.750000   96.000000
max    33.000000  100.000000

#### DataFrame 기본정보 확인

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 1번 to 6번
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   주소      6 non-null      object
 2   나이      6 non-null      int64
 3   점수      6 non-null      int64
 4   언어      4 non-null      object
dtypes: int64(2), object(3)
memory usage: 288.0+ bytes

#### df의 처음 5개 행 확인

In [5]:
df.head()

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN

#### df의 처음 3개 행 확인

In [6]:
df.head(3)

     이름  주소  나이  점수      언어
번호
1번  김길동  광주  33  76  Python
2번  이길동  서울  23  88    Java
3번  강길동  대구  30  98     C++

#### df의 마지막 5개 행 확인

In [7]:
df.tail()

     이름  주소  나이   점수    언어
번호
2번  이길동  서울  23   88  Java
3번  강길동  대구  30   98   C++
4번  홍길동  대전  20  100   NaN
5번  박길동  광주  21   60   NaN
6번  나길동  서울  25   90     C

#### df의 마지막 3개 행 확인

In [30]:
df.tail

Signature: df.tail(n: 'int' = 5) -> 'Self'
Docstring:
Return the last `n` rows.

This function returns last `n` rows from the object based on
position. It is useful for quickly verifying data, for example,
after sorting or appending rows.

For negative values of `n`, this function returns all rows except
the first `|n|` rows, equivalent to ``df[|n|:]``.

If n is larger than the number of rows, this function returns all rows.

Parameters
----------
n : int, default 5
    Number of rows to select.

Returns
-------
type of caller
    The last `n` rows of the caller object.

See Also
--------
DataFrame.head : The first `n` rows of the caller object.

Examples
--------
>>> df = pd.DataFrame({'animal': ['alligator', 'bee', 'falcon', 'lion',
...                    'monkey', 'parrot', 'shark', 'whale', 'zebra']})
>>> df
      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey
5     parrot
6      shark
7      whale
8      zebra

Viewing the last 5 lines

>>> df.tail()
   animal
4  monkey
5  parrot
6   shark
7   whale
8   zebra

Viewing the last `n` lines (three in this case)

>>> df.tail(3)
  animal
6  shark
7  whale
8  zebra

For negative values of `n`

>>> df.tail(-3)
   animal
3    lion
4  monkey
5  parrot
6   shark
7   whale
8   zebra
File:      c:\users\user\anaconda3\lib\site-packages\pandas\core\generic.py
Type:      method

In [27]:
type(df.tail)

method

In [28]:
type(df.values)

numpy.ndarray

#### df의 데이터값 확인

In [31]:
df.values

Type:        property
String form: <property object at 0x000001D0C94C71F0>
Docstring:
Return a Numpy representation of the DataFrame.

.. warning::

   We recommend using :meth:`DataFrame.to_numpy` instead.

Only the values in the DataFrame will be returned, the axes labels
will be removed.

Returns
-------
numpy.ndarray
    The values of the DataFrame.

See Also
--------
DataFrame.to_numpy : Recommended alternative to this method.
DataFrame.index : Retrieve the index labels.
DataFrame.columns : Retrieving the column names.

Notes
-----
The dtype will be a lower-common-denominator dtype (implicit
upcasting); that is to say if the dtypes (even of numeric types)
are mixed, the one that accommodates all will be chosen. Use this
with care if you are not dealing with the blocks.

e.g. If the dtypes are float16 and float32, dtype will be upcast to
float32.  If dtypes are int32 and uint8, dtype will be upcast to
int32. By :func:`numpy.find_common_type` convention, mixing int64
and uint64 will result in a float64 dtype.

Examples
--------
A DataFrame where all columns are the same type (e.g., int64) results
in an array of the same type.

>>> df = pd.DataFrame({'age':    [ 3,  29],
...                    'height': [94, 170],
...                    'weight': [31, 115]})
>>> df
   age  height  weight
0    3      94      31
1   29     170     115
>>> df.dtypes
age       int64
height    int64
weight    int64
dtype: object
>>> df.values
array([[  3,  94,  31],
       [ 29, 170, 115]])

A DataFrame with mixed type columns(e.g., str/object, int64, float32)
results in an ndarray of the broadest type that accommodates these
mixed types (e.g., object).

>>> df2 = pd.DataFrame([('parrot',   24.0, 'second'),
...                     ('lion',     80.5, 1),
...                     ('monkey', np.nan, None)],
...                   columns=('name', 'max_speed', 'rank'))
>>> df2.dtypes
name          object
max_speed    float64
rank          object
dtype: object
>>> df2.values
array([['parrot', 24.0, 'second'],
       ['lion', 80.5, 1],
       ['monkey', nan, None]], dtype=object)

#### 인덱스, 컬럼, 구조 확인

In [15]:
df.index

Index(['1번', '2번', '3번', '4번', '5번', '6번'], dtype='object', name='번호')

In [32]:
df.columns?

Type:        Index
String form: Index(['이름', '주소', '나이', '점수', '언어'], dtype='object')
Length:      5
File:        c:\users\user\anaconda3\lib\site-packages\pandas\core\indexes\base.py
Docstring:
Immutable sequence used for indexing and alignment.

The basic object storing axis labels for all pandas objects.

.. versionchanged:: 2.0.0

   Index can hold all numpy numeric dtypes (except float16). Previously only
   int64/uint64/float64 dtypes were accepted.

Parameters
----------
data : array-like (1-dimensional)
dtype : str, numpy.dtype, or ExtensionDtype, optional
    Data type for the output Index. If not specified, this will be
    inferred from `data`.
    See the :ref:`user guide <basics.dtypes>` for more usages.
copy : bool, default False
    Copy input data.
name : object
    Name to be stored in the index.
tupleize_cols : bool (default: True)
    When True, attempt to create a MultiIndex if possible.

See Also
--------
RangeIndex : Index implementing a monotonic integer range.
CategoricalIndex : Index of :class:`Categorical` s.
MultiIndex : A multi-level, or hierarchical Index.
IntervalIndex : An Index of :class:`Interval` s.
DatetimeIndex : Index of datetime64 data.
TimedeltaIndex : Index of timedelta64 data.
PeriodIndex : Index of Period data.

Notes
-----
An Index instance can **only** contain hashable objects.
An Index instance *can not* hold numpy float16 dtype.

Examples
--------
>>> pd.Index([1, 2, 3])
Index([1, 2, 3], dtype='int64')

>>> pd.Index(list('abc'))
Index(['a', 'b', 'c'], dtype='object')

>>> pd.Index([1, 2, 3], dtype="uint8")
Index([1, 2, 3], dtype='uint8')

In [26]:
df.shape

(6, 5)

In [12]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

### Series 확인

#### Series의 통계량 확인

In [14]:
df['점수'].describe()

count      6.000000
mean      85.333333
std       15.055453
min       60.000000
25%       79.000000
50%       89.000000
75%       96.000000
max      100.000000
Name: 점수, dtype: float64

#### 점수 컬럼의 최대/최소 / 큰값 순으로 몇개 / 평균 / 합

In [33]:
df['점수'].min()

SyntaxError: invalid syntax (379045893.py, line 1)

In [18]:
df['점수'].max()

100

In [19]:
df['점수'].nlargest(3)

번호
4번    100
3번     98
6번     90
Name: 점수, dtype: int64

In [20]:
df['점수'].mean()

np.float64(85.33333333333333)

In [21]:
df['점수'].sum()

np.int64(512)

In [34]:
df.sum

Signature:
df.sum(
    axis: 'Axis | None' = 0,
    skipna: 'bool' = True,
    numeric_only: 'bool' = False,
    min_count: 'int' = 0,
    **kwargs,
)
Docstring:
Return the sum of the values over the requested axis.

This is equivalent to the method ``numpy.sum``.

Parameters
----------
axis : {index (0), columns (1)}
    Axis for the function to be applied on.
    For `Series` this parameter is unused and defaults to 0.

    .. warning::

        The behavior of DataFrame.sum with ``axis=None`` is deprecated,
        in a future version this will reduce over both axes and return a scalar
        To retain the old behavior, pass axis=0 (or do not pass axis).

    .. versionadded:: 2.0.0

skipna : bool, default True
    Exclude NA/null values when computing the result.
numeric_only : bool, default False
    Include only float, int, boolean columns. Not implemented for Series.

min_count : int, default 0
    The required number of valid values to perform the operation. If fewer than
    ``min_count`` non-NA values are present the result will be NA.
**kwargs
    Additional keyword arguments to be passed to the function.

Returns
-------
Series or scalar

See Also
--------
Series.sum : Return the sum.
Series.min : Return the minimum.
Series.max : Return the maximum.
Series.idxmin : Return the index of the minimum.
Series.idxmax : Return the index of the maximum.
DataFrame.sum : Return the sum over the requested axis.
DataFrame.min : Return the minimum over the requested axis.
DataFrame.max : Return the maximum over the requested axis.
DataFrame.idxmin : Return the index of the minimum over the requested axis.
DataFrame.idxmax : Return the index of the maximum over the requested axis.

Examples
--------
>>> idx = pd.MultiIndex.from_arrays([
...     ['warm', 'warm', 'cold', 'cold'],
...     ['dog', 'falcon', 'fish', 'spider']],
...     names=['blooded', 'animal'])
>>> s = pd.Series([4, 2, 0, 8], name='legs', index=idx)
>>> s
blooded  animal
warm     dog       4
         falcon    2
cold     fish      0
         spider    8
Name: legs, dtype: int64

>>> s.sum()
14

By default, the sum of an empty or all-NA Series is ``0``.

>>> pd.Series([], dtype="float64").sum()  # min_count=0 is the default
0.0

This can be controlled with the ``min_count`` parameter. For example, if
you'd like the sum of an empty series to be NaN, pass ``min_count=1``.

>>> pd.Series([], dtype="float64").sum(min_count=1)
nan

Thanks to the ``skipna`` parameter, ``min_count`` handles all-NA and
empty series identically.

>>> pd.Series([np.nan]).sum()
0.0

>>> pd.Series([np.nan]).sum(min_count=1)
nan
File:      c:\users\user\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

#### 특정열의 개수 카운트 / 유일값 / 유일값 개수 (언어, 주소 컬럼)

In [23]:
df['언어'].count()

np.int64(4)

In [24]:
df['주소'].unique()

array(['광주', '서울', '대구', '대전'], dtype=object)

In [25]:
df['주소'].nunique()

4